run/myIMF2_case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     myinterMixingFoam2;

startFrom       latestTime;

startTime       0;

stopAt          writeNow;

endTime         0.2;

deltaT          0.0001;

adjustTimeStep  yes;

maxCo           0.2;

maxAlphaCo      0.05;

maxDeltaT       0.0001;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    residuals
    {
        type            residuals;
        libs            ( "libutilityFunctionObjects.so" );
        fields          ( U p_rgh T alpha.polymer alpha.nitrogen alpha.volatiles );
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        writePrecision  10;
    }
    minMax_alphaPolymer
    {
        type            fieldMinMax;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        fields          ( alpha.polymer );
    }
    wallTavg
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        regionType      patch;
        name            heatedWall;
        operation       areaAverage;
        fields          ( T );
        writeFields     no;
        log             yes;
    }
    volAlphaPolymer
    {
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        regionType      all;
        operation       volIntegrate;
        fields          ( alpha.polymer );
        writeFields     no;
        log             yes;
    }
    minMax_T
    {
        type            fieldMinMax;
        libs            ( "libfieldFunctionObjects.so" );
        fields          ( T );
        writeControl    timeStep;
        writeInterval   1;
        log             yes;
    }
    filmThicknessAvg
    {
        type            coded;
        libs            ( "libutilityFunctionObjects.so" );
        name            filmThicknessAvgFO;
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        codeInclude     #{
      #include "fvCFD.H"
    #};
        codeOptions     #{
      -I$(FOAM_SRC)/finiteVolume/lnInclude
    #};
        codeExecute     #{
      const fvMesh& mesh = refCast<const fvMesh>(obr_);

      // 允许字段名兜底
      word alphaName("alpha.polymer");
      if (!mesh.foundObject<volScalarField>(alphaName))
      {
        if (mesh.foundObject<volScalarField>("alpha1"))             alphaName = "alpha1";
        else if (mesh.foundObject<volScalarField>("alpha.plastic"))  alphaName = "alpha.plastic";
        else { Info<< "filmThicknessAvg: alpha field not found\n"; return true; }
      }

      const volScalarField& alpha = mesh.lookupObject<volScalarField>(alphaName);
      const dimensionedScalar Vliquid = fvc::domainIntegrate(alpha);

      const word wallName("heatedWall");
      const label pI = mesh.boundaryMesh().findPatchID(wallName);
      if (pI == -1) { Info<< "filmThicknessAvg: patch '"<<wallName<<"' not found\n"; return true; }
      const scalar Aw = gSum(mesh.magSf().boundaryField()[pI]);

      const scalar deltaAvg = (Aw > SMALL) ? Vliquid.value()/Aw : GREAT;

      const fileName outDir = mesh.time().path()/"postProcessing"/"filmThicknessAvg";
      mkDir(outDir);
      OFstream os(outDir/"filmThickness.dat");
      os  << mesh.time().timeOutputValue() << " " << deltaAvg << nl;

      Info<< "filmThicknessAvg: t=" << mesh.time().timeName()
          << ", V_liquid=" << Vliquid.value()
          << " m^3, A_wall=" << Aw
          << " m^2, deltaAvg=" << deltaAvg << " m" << nl;

      return true;
    #};
    }
    volAvg_rhoCp
    {
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        regionType      all;
        operation       volAverage;
        fields          ( rhoCp );
        writeFields     no;
        log             yes;
    }
    Qreact_total
    {
        type            volFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    adjustableRunTime;
        writeInterval   0.01;
        regionType      all;
        operation       volIntegrate;
        fields          ( Qreact );
        writeFields     no;
        log             yes;
    }
}


// ************************************************************************* //
