run/myIMF2_case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| blockMeshDict : 0.30 (x) × 1.60 (y); inlet 5 mm on top-left;               |
| outlet 30 mm at top-right; left wall heated (refined); 2D thickness 1 mm.  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1.0;

// x-splits: 0, 0.005, 0.300
// y-splits: 0, 1.57, 1.60
// z: 0, 0.001  (2D: front/back = empty)
vertices
(
    (0      0     0)      //  0
    (0.005  0     0)      //  1
    (0.30   0     0)      //  2
    (0      1.57  0)      //  3
    (0.005  1.57  0)      //  4
    (0.30   1.57  0)      //  5
    (0      1.60  0)      //  6
    (0.005  1.60  0)      //  7
    (0.30   1.60  0)      //  8

    (0      0     0.001)  //  9
    (0.005  0     0.001)  // 10
    (0.30   0     0.001)  // 11
    (0      1.57  0.001)  // 12
    (0.005  1.57  0.001)  // 13
    (0.30   1.57  0.001)  // 14
    (0      1.60  0.001)  // 15
    (0.005  1.60  0.001)  // 16
    (0.30   1.60  0.001)  // 17
);

// ---------------------------------------------------------------------------
// 4 blocks: (x: 0–5 mm | 5–300 mm) × (y: 0–1.57 m | 1.57–1.60 m)
//
// 网格数量与分级：
// - 左侧 0–5 mm：x 向细化 (nxL=48)，simpleGrading 第一项取 8 → 朝 x=0 聚集
// - 右侧 5–300 mm：x 向做过渡 (nxR=192)，simpleGrading 第一项取 0.6 → 在 x=5 mm
//   处较大，向右逐渐变粗，平滑对接左块的末端
// - 顶部 30 mm（入口区）：y 向进一步细化 (nyTop=60) 且取 0.2 → 朝顶部聚集
// - 底部 1.57 m：y 向均匀 (nyBot=620)
// ---------------------------------------------------------------------------
blocks
(
    // left × bottom  (x:0–0.005, y:0–1.57)
    // simpleGrading (gx gy gz): gx=8 → 朝起点(x=0)聚集
    hex (0 1 4 3 9 10 13 12)    ( 48 620 1) simpleGrading (8     1    1)

    // right × bottom (x:0.005–0.30, y:0–1.57)
    // gx=0.6 → 在起点(x=0.005)的单元更大，向右逐渐变粗，与左块末端平滑过渡
    hex (1 2 5 4 10 11 14 13)   (192 620 1) simpleGrading (0.6   1    1)

    // left × top (x:0–0.005, y:1.57–1.60)
    // gx=8（靠壁加密）；gy=0.2 → 朝高端(y=1.60，入口)聚集
    hex (3 4 7 6 12 13 16 15)   ( 48  60 1) simpleGrading (8     0.2  1)

    // right × top (x:0.005–0.30, y:1.57–1.60)
    // gx=0.6（与左块过渡）；gy=0.2（入口区向上聚集）
    hex (4 5 8 7 13 14 17 16)   (192  60 1) simpleGrading (0.6   0.2  1)
);

edges ();

// Patches
boundary
(
    // 2D: z=0 / z=0.001 面统一设为空间二维 ‘empty’
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)    (1 2 5 4)    (3 4 7 6)    (4 5 8 7)
            (9 10 13 12) (10 11 14 13) (12 13 16 15) (13 14 17 16)
        );
    }

    // 左侧加热壁
    heatedWall
    {
        type wall;
        faces
        (
            (0 3 12 9)
            (3 6 15 12)
        );
    }

    // 右侧竖直壁（不含顶端出口窗口）
    rightWall
    {
        type wall;
        faces
        (
            (2 5 14 11)   // y = 0 → 1.57 m
        );
    }

    // 顶端右侧 30 mm 出口窗口
    outlet
    {
        type patch;
        faces
        (
            (5 8 17 14)   // y = 1.57 → 1.60 m
        );
    }

    // 底边
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 10 9)
            (1 2 11 10)
        );
    }

    // 顶边：左 5 mm 入口 + 其余墙面
    meltInlet
    {
        type patch;
        faces
        (
            (6 7 16 15)   // x = 0 → 5 mm
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (7 8 17 16)   // x = 5 mm → 300 mm
        );
    }
);

mergePatchPairs ();

